Tekla Open API Reference for Tekla Structures 2025
PluginPropertyFileLocationAttribute.Suffix Property
Gets the property file suffix.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Suffix { get; }
Public ReadOnly Property Suffix As String
	Get
Property Value
Type: String
See Also
Reference
PluginPropertyFileLocationAttribute Class
Tekla.Structures.Plugins Namespace